lst = [
    ('车次  ', '出发站-到达站', '出发时间', '到达时间', '历时时长'),
    ('G1569', '北京南-天津南', '18:06', '18:39', '00:33'),
    ('G1567', '北京南-天津南', '18:15', '18:49', '00:34'),
    ('G8917', '北京南-天津西', '18:20', '19:19', '00:59'),
    ('G203 ', '北京南-天津南', '18:35', '19:09', '00:34')
]
for item in lst:
    for i in item:
        print(i, end='\t\t')
    print()
num = input('请输入要购买的车次:')
print(num)
people = input('请输入乘车人,如果是多位乘车人使用逗号分隔:')
print(people)

tp = ()
for item in lst:
    if num == item[0]:
        tp = item
        break


print("您已经购买了"+num, tp[1], tp[2]+"开,请"+people+"尽快换取纸质车票。【铁路客服】")
